In [ ]:
### class 하나 생성
### 1. 인자값으로 url(주소) 받아오기(.csv 파일)
### 2. 함수를 하나 생성 -> url에 있는 csv 파일을 읽어오고,  "Counrty" 기준으로 sort, 인덱스값을 초기화.
### 3. 함수를 하나 생성 -> 인자값을 리스트로 받는다. -> 이매개변수를 기준으로 columns삭제

In [1]:
import pandas as pd

In [2]:
class Class_1():
    
    def __init__(self, input_url):
        self.sales_df = pd.read_csv(input_url)
        ### self.columns_list = []
    
    def sort_1(self, input = "Country", input_inplace = True):
        self.sales_df.sort_values(input, inplace = input_inplace)
        self.sales_df.reset_index(drop=True, inplace = input_inplace)
        return self.sales_df

    def drop_1(self, *input_columns):
        
        self.input = list(set(input_columns))
        self.sales_df.drop(self.input, axis = "columns", inplace = True)
        
        return self.sales_df

In [3]:
a = Class_1(".\csv\Sales Records.csv")
a.sort_1("Country").head(3)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Afghanistan,Cereal,Offline,H,7/24/2013,933963477,8/23/2013,9402,205.70,117.11,1933991.40,1101068.22,832923.18
1,Middle East and North Africa,Afghanistan,Household,Offline,L,2/4/2012,772306096,3/21/2012,1391,668.27,502.54,929563.57,699033.14,230530.43
2,Middle East and North Africa,Afghanistan,Cereal,Offline,H,8/20/2015,667230880,10/5/2015,7300,205.70,117.11,1501610.00,854903.00,646707.00

In [90]:
a.drop_1("Ship Date", 'Order ID', 'Sales Channel', 'Total Revenue').head(3)

,Region,Country,Item Type,Order Priority,Order Date,Units Sold,Unit Price,Unit Cost,Total Cost,Total Profit
0,Middle East and North Africa,Afghanistan,Cereal,H,7/24/2013,9402,205.70,117.11,1101068.22,832923.18
1,Middle East and North Africa,Afghanistan,Household,L,2/4/2012,1391,668.27,502.54,699033.14,230530.43
2,Middle East and North Africa,Afghanistan,Cereal,H,8/20/2015,7300,205.70,117.11,854903.00,646707.00

In [48]:
import mod1

In [50]:
mod1.add(3,4)

7

7

In [51]:
from module import mod2

In [52]:
mod2.sub(5,3)

2

In [64]:
from mod3 import add

In [65]:
add(5,3)

8

In [67]:
from mod3 import sub

In [68]:
sub(5,3)

2

In [69]:
import numpy as np

In [81]:
n_a = np.random.random((10,2))
n_a_1 = n_a

In [79]:
for i in range(len(n_a)):
    if n_a[i][1] < 0.5:
        n_a[i][1] = 0
    else :
        n_a[i][1] = 1

n_a

array([[0.6270461 , 1.        ],
       [0.84379117, 0.        ],
       [0.81181539, 1.        ],
       [0.16821694, 0.        ],
       [0.11017554, 1.        ],
       [0.99050326, 1.        ],
       [0.65119499, 0.        ],
       [0.87806149, 0.        ],
       [0.20552463, 1.        ],
       [0.44589602, 1.        ]])

In [82]:
dt = pd.DataFrame(n_a_1)
dt

          0         1
0  0.325276  0.386920
1  0.738614  0.948635
2  0.951317  0.274617
3  0.796892  0.194241
4  0.165053  0.336352
5  0.174358  0.946874
6  0.701106  0.594497
7  0.837261  0.330505
8  0.004217  0.078339
9  0.198950  0.487823

In [86]:
dt[2] = dt[1].apply(lambda x : 0 if ( x <= 0.5) else 1)
dt

          0         1  2  2
0  0.325276  0.386920  0  0
1  0.738614  0.948635  1  1
2  0.951317  0.274617  0  0
3  0.796892  0.194241  0  0
4  0.165053  0.336352  0  0
5  0.174358  0.946874  1  1
6  0.701106  0.594497  1  1
7  0.837261  0.330505  0  0
8  0.004217  0.078339  0  0
9  0.198950  0.487823  0  0

In [87]:
dt.drop("2", axis = "columns", inplace=True)
dt

          0         1  2
0  0.325276  0.386920  0
1  0.738614  0.948635  1
2  0.951317  0.274617  0
3  0.796892  0.194241  0
4  0.165053  0.336352  0
5  0.174358  0.946874  1
6  0.701106  0.594497  1
7  0.837261  0.330505  0
8  0.004217  0.078339  0
9  0.198950  0.487823  0